// Реалізувати структуру «Автомобіль» (довжина, кліренс(висота посадки), об’єм двигуна, потужність двигуна, діаметр коліс, колір, тип коробки передач).
//Створіть функції для задання значень, відображення значень,пошуку значень.
#include <iostream>
#include <string>
#include<Windows.h>
using namespace std;
struct car
{	double length=0; //довжина
	double clearence=0;//кліренс (висота посадки)
	double volume=0;//об’єм двигуна
	double power=0;//потужність  двигуна
	double diameter=0;//діаметр коліс
	string color;//колір
	string transmission;//тип коробки передач
	void input() {//функція для задання значень
		cout << "Введіть довжину автомобіля в сантиметрах " << endl;
		cin >> length;
		cout << "Введіть висоту посадки в міліметрах " << endl;
		cin >> clearence;
		cout << "Введіть об'єм двигуна автомобіля в літрах  " << endl;
		cin >> volume;
		cout << "Введіть потужність двигуна автомобіля в кінських силах " << endl;
		cin >> power;
		cout << "Введіть діаметр коліс автомобіля в дюймах" << endl;
		cin >> diameter;
		cout << "Введіть колір автомобіля " << endl;
		cin >> color;
		cout << "Введіть тип коробки передач " << endl;
		cin >> transmission;
	}
	void printCar() {//ф-н відображення значень
		cout << "Довжина автомобіля ="<<length<< " сантиметрів" << endl;
		cout << "Висота посадки автомобіля ="<<clearence <<" міліметрів" << endl;
		cout << "Об'єм двигуна автомобіля ="<<volume <<" літрів" << endl;
		cout << "Потужність двигуна автомобіля ="<<power <<" кінських сил" << endl;
		cout << "Діаметр коліс автомобіля ="<<diameter <<" дюймів" << endl;
		cout << "Колір автомобіля ="<< color  << endl;
		cout << "Тип коробки передач ="<<transmission << endl;	
	}
	void dataSearche() {//ф-н пошуку значень
		char v= 0;//зміна для вибору яку шнформацію подивитись про автомобіль
		char c = 'y';//зміна для вибору продовжити пошук інформації чи завершити пошук
		do
		{		
		cout << "Якщо хочете дізнатися довжину автомобіля , нажміть 1" << endl;
		cout << "Якщо хочете дізнатися висота посадки автомобіля , нажміть 2" << endl;
		cout << "Якщо хочете дізнатися об'єм двигуна автомобіля , нажміть 3" << endl;
		cout << "Якщо хочете дізнатися потужність двигуна автомобіля , нажміть 4" << endl;
		cout << "Якщо хочете дізнатися діаметр коліс автомобіля , нажміть 5" << endl;
		cout << "Якщо хочете дізнатися колір автомобіля нажміть 6" << endl;
		cout << "Якщо хочете дізнатися тип коробки передач автомобіля , нажміть 7" << endl;
		cin >> v;
		cout << endl;
		switch (v)//використовуєм свіч для пошуку інформації
		{
		case'1':cout << "Довжину автомобіля = " << length << " сантиметрів" << endl; break;
		case'2':cout << "Висота посадки автомобіля = " << clearence << " міліметрів" << endl; break;
		case'3':cout << "Об'єм двигуна автомобіля = " << volume << " літрів" << endl; break;
		case'4':cout << "Потужність двигуна автомобіля = " << power << " кінських сил" << endl; break;
		case'5':cout << "Діаметр коліс автомобіля = " << diameter << " дюймів" << endl; break;
		case'6':cout << "Колір автомобіля = " << color << endl; break;
		case'7':cout << "Тип коробки передач = " << transmission << endl; break;
		
		default:cout << "Введіть коректну дію " << endl;
						
		}cout << "\nПродовжити пошук інформацію?(y/n)" << endl;
		cin >> c;
		} 		
		while (c != 'n');
	}
};
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	car information;
	information.input();//функція для задання значень
	cout << endl << endl;
	information.printCar();//ф-н відображення значень
	cout << endl << endl;
	information.dataSearche();//ф-н пошуку значень

	return 0;
}

